GopalSaraf/Practicals/PSDL/include/proc/pic18f86j93.inc
#define SEG20COM0                        BANKMASK(LCDDATA2), 4, a
#define SEG20COM1                        BANKMASK(LCDDATA8), 4, a
#define SEG20COM2                        BANKMASK(LCDDATA14), 4, a
#define SEG20COM3                        BANKMASK(LCDDATA20), 4, a
#define SEG21                            BANKMASK(PORTF), 3, a
#define SEG21COM0                        BANKMASK(LCDDATA2), 5, a
#define SEG21COM1                        BANKMASK(LCDDATA8), 5, a
#define SEG21COM2                        BANKMASK(LCDDATA14), 5, a
#define SEG21COM3                        BANKMASK(LCDDATA20), 5, a
#define SEG22                            BANKMASK(PORTF), 4, a
#define SEG22COM0                        BANKMASK(LCDDATA2), 6, a
#define SEG22COM1                        BANKMASK(LCDDATA8), 6, a
#define SEG22COM2                        BANKMASK(LCDDATA14), 6, a
#define SEG22COM3                        BANKMASK(LCDDATA20), 6, a
#define SEG23                            BANKMASK(PORTF), 5, a
#define SEG23COM0                        BANKMASK(LCDDATA2), 7, a
#define SEG23COM1                        BANKMASK(LCDDATA8), 7, a
#define SEG23COM2                        BANKMASK(LCDDATA14), 7, a
#define SEG23COM3                        BANKMASK(LCDDATA20), 7, a
#define SEG24                            BANKMASK(PORTF), 6, a
#define SEG24COM0                        BANKMASK(LCDDATA3), 0, a
#define SEG24COM1                        BANKMASK(LCDDATA9), 0, a
#define SEG24COM2                        BANKMASK(LCDDATA15), 0, a
#define SEG24COM3                        BANKMASK(LCDDATA21), 0, a
#define SEG25                            BANKMASK(PORTF), 7, a
#define SEG25COM0                        BANKMASK(LCDDATA3), 1, a
#define SEG25COM1                        BANKMASK(LCDDATA9), 1, a
#define SEG25COM2                        BANKMASK(LCDDATA15), 1, a
#define SEG25COM3                        BANKMASK(LCDDATA21), 1, a
#define SEG26                            BANKMASK(PORTG), 4, a
#define SEG26COM0                        BANKMASK(LCDDATA3), 2, a
#define SEG26COM1                        BANKMASK(LCDDATA9), 2, a
#define SEG26COM2                        BANKMASK(LCDDATA15), 2, a
#define SEG26COM3                        BANKMASK(LCDDATA21), 2, a
#define SEG27                            BANKMASK(PORTC), 6, a
#define SEG27COM0                        BANKMASK(LCDDATA3), 3, a
#define SEG27COM1                        BANKMASK(LCDDATA9), 3, a
#define SEG27COM2                        BANKMASK(LCDDATA15), 3, a
#define SEG27COM3                        BANKMASK(LCDDATA21), 3, a
#define SEG28                            BANKMASK(PORTC), 7, a
#define SEG28COM0                        BANKMASK(LCDDATA3), 4, a
#define SEG28COM1                        BANKMASK(LCDDATA9), 4, a
#define SEG28COM2                        BANKMASK(LCDDATA15), 4, a
#define SEG28COM3                        BANKMASK(LCDDATA21), 4, a
#define SEG29                            BANKMASK(PORTB), 5, a
#define SEG29COM0                        BANKMASK(LCDDATA3), 5, a
#define SEG29COM1                        BANKMASK(LCDDATA9), 5, a
#define SEG29COM2                        BANKMASK(LCDDATA15), 5, a
#define SEG29COM3                        BANKMASK(LCDDATA21), 5, a
#define SEG2COM0                         BANKMASK(LCDDATA0), 2, a
#define SEG2COM1                         BANKMASK(LCDDATA6), 2, a
#define SEG2COM2                         BANKMASK(LCDDATA12), 2, a
#define SEG3                             BANKMASK(PORTD), 3, a
#define SEG30                            BANKMASK(PORTB), 0, a
#define SEG30COM0                        BANKMASK(LCDDATA3), 6, a
#define SEG30COM1                        BANKMASK(LCDDATA9), 6, a
#define SEG30COM2                        BANKMASK(LCDDATA15), 6, a
#define SEG30COM3                        BANKMASK(LCDDATA21), 6, a
#define SEG31                            BANKMASK(PORTE), 7, a
#define SEG31COM0                        BANKMASK(LCDDATA3), 7, a
#define SEG31COM1                        BANKMASK(LCDDATA9), 7, a
#define SEG31COM2                        BANKMASK(LCDDATA15), 7, a
#define SEG31COM3                        BANKMASK(LCDDATA21), 7, a
#define SEG32                            BANKMASK(PORTC), 1, a
#define SEG32COM0                        BANKMASK(LCDDATA4), 0, a
#define SEG32COM1                        BANKMASK(LCDDATA10), 0, a
#define SEG32COM2                        BANKMASK(LCDDATA16), 0, a
#define SEG32COM3                        BANKMASK(LCDDATA22), 0, a
#define SEG33                            BANKMASK(PORTJ), 1, a
#define SEG33COM0                        BANKMASK(LCDDATA4), 1, a
#define SEG33COM1                        BANKMASK(LCDDATA10), 1, a
#define SEG33COM2                        BANKMASK(LCDDATA16), 1, a
#define SEG33COM3                        BANKMASK(LCDDATA22), 1, a
#define SEG34                            BANKMASK(PORTJ), 2, a
#define SEG34COM0                        BANKMASK(LCDDATA4), 2, a
#define SEG34COM1                        BANKMASK(LCDDATA10), 2, a
#define SEG34COM2                        BANKMASK(LCDDATA16), 2, a
#define SEG34COM3                        BANKMASK(LCDDATA22), 2, a
#define SEG35                            BANKMASK(PORTJ), 3, a
#define SEG35COM0                        BANKMASK(LCDDATA4), 3, a
#define SEG35COM1                        BANKMASK(LCDDATA10), 3, a
#define SEG35COM2                        BANKMASK(LCDDATA16), 3, a
#define SEG35COM3                        BANKMASK(LCDDATA22), 3, a
#define SEG36                            BANKMASK(PORTJ), 7, a
#define SEG36COM0                        BANKMASK(LCDDATA4), 4, a
#define SEG36COM1                        BANKMASK(LCDDATA10), 4, a
#define SEG36COM2                        BANKMASK(LCDDATA16), 4, a
#define SEG36COM3                        BANKMASK(LCDDATA22), 4, a
#define SEG37                            BANKMASK(PORTJ), 6, a
#define SEG37COM0                        BANKMASK(LCDDATA4), 5, a
#define SEG37COM1                        BANKMASK(LCDDATA10), 5, a
#define SEG37COM2                        BANKMASK(LCDDATA16), 5, a
#define SEG37COM3                        BANKMASK(LCDDATA22), 5, a
#define SEG38                            BANKMASK(PORTJ), 5, a
#define SEG38COM0                        BANKMASK(LCDDATA4), 6, a
#define SEG38COM1                        BANKMASK(LCDDATA10), 6, a
#define SEG38COM2                        BANKMASK(LCDDATA16), 6, a
#define SEG38COM3                        BANKMASK(LCDDATA22), 6, a
#define SEG39                            BANKMASK(PORTJ), 4, a
#define SEG39COM0                        BANKMASK(LCDDATA4), 7, a
#define SEG39COM1                        BANKMASK(LCDDATA10), 7, a
#define SEG39COM2                        BANKMASK(LCDDATA16), 7, a
#define SEG39COM3                        BANKMASK(LCDDATA22), 7, a
#define SEG3COM0                         BANKMASK(LCDDATA0), 3, a
#define SEG3COM1                         BANKMASK(LCDDATA6), 3, a
#define SEG3COM2                         BANKMASK(LCDDATA12), 3, a
#define SEG4                             BANKMASK(PORTD), 4, a
#define SEG40                            BANKMASK(PORTH), 4, a
#define SEG40COM0                        BANKMASK(LCDDATA5), 0, a
#define SEG40COM1                        BANKMASK(LCDDATA11), 0, a
#define SEG40COM2                        BANKMASK(LCDDATA17), 0, a
#define SEG40COM3                        BANKMASK(LCDDATA23), 0, a
#define SEG41                            BANKMASK(PORTH), 5, a
#define SEG41COM0                        BANKMASK(LCDDATA5), 1, a
#define SEG41COM1                        BANKMASK(LCDDATA11), 1, a
#define SEG41COM2                        BANKMASK(LCDDATA17), 1, a
#define SEG41COM3                        BANKMASK(LCDDATA23), 1, a
#define SEG42                            BANKMASK(PORTH), 6, a
#define SEG42COM0                        BANKMASK(LCDDATA5), 2, a
#define SEG42COM1                        BANKMASK(LCDDATA11), 2, a
#define SEG42COM2                        BANKMASK(LCDDATA17), 2, a
#define SEG42COM3                        BANKMASK(LCDDATA23), 2, a
#define SEG43                            BANKMASK(PORTH), 7, a
#define SEG43COM0                        BANKMASK(LCDDATA5), 3, a
#define SEG43COM1                        BANKMASK(LCDDATA11), 3, a
#define SEG43COM2                        BANKMASK(LCDDATA17), 3, a
#define SEG43COM3                        BANKMASK(LCDDATA23), 3, a
#define SEG44                            BANKMASK(PORTH), 3, a
#define SEG44COM0                        BANKMASK(LCDDATA5), 4, a
#define SEG44COM1                        BANKMASK(LCDDATA11), 4, a
#define SEG44COM2                        BANKMASK(LCDDATA17), 4, a
#define SEG44COM3                        BANKMASK(LCDDATA23), 4, a
#define SEG45                            BANKMASK(PORTH), 2, a
#define SEG45COM0                        BANKMASK(LCDDATA5), 5, a
#define SEG45COM1                        BANKMASK(LCDDATA11), 5, a
#define SEG45COM2                        BANKMASK(LCDDATA17), 5, a
#define SEG45COM3                        BANKMASK(LCDDATA23), 5, a
#define SEG46                            BANKMASK(PORTH), 1, a
#define SEG46COM0                        BANKMASK(LCDDATA5), 6, a
#define SEG46COM1                        BANKMASK(LCDDATA11), 6, a
#define SEG46COM2                        BANKMASK(LCDDATA17), 6, a
#define SEG46COM3                        BANKMASK(LCDDATA23), 6, a
#define SEG47                            BANKMASK(PORTH), 0, a
#define SEG47COM0                        BANKMASK(LCDDATA5), 7, a
#define SEG47COM1                        BANKMASK(LCDDATA11), 7, a
#define SEG47COM2                        BANKMASK(LCDDATA17), 7, a
#define SEG47COM3                        BANKMASK(LCDDATA23), 7, a
#define SEG4COM0                         BANKMASK(LCDDATA0), 4, a
#define SEG4COM1                         BANKMASK(LCDDATA6), 4, a
#define SEG4COM2                         BANKMASK(LCDDATA12), 4, a
#define SEG5                             BANKMASK(PORTD), 5, a
#define SEG5COM0                         BANKMASK(LCDDATA0), 5, a
#define SEG5COM1                         BANKMASK(LCDDATA6), 5, a
#define SEG5COM2                         BANKMASK(LCDDATA12), 5, a
#define SEG6                             BANKMASK(PORTD), 6, a
#define SEG6COM0                         BANKMASK(LCDDATA0), 6, a
#define SEG6COM1                         BANKMASK(LCDDATA6), 6, a
#define SEG6COM2                         BANKMASK(LCDDATA12), 6, a
#define SEG7                             BANKMASK(PORTD), 7, a
#define SEG7COM0                         BANKMASK(LCDDATA0), 7, a
#define SEG7COM1                         BANKMASK(LCDDATA6), 7, a
#define SEG7COM2                         BANKMASK(LCDDATA12), 7, a
#define SEG8                             BANKMASK(PORTB), 1, a
#define SEG8COM0                         BANKMASK(LCDDATA1), 0, a
#define SEG8COM1                         BANKMASK(LCDDATA7), 0, a
#define SEG8COM2                         BANKMASK(LCDDATA13), 0, a
#define SEG8COM3                         BANKMASK(LCDDATA19), 0, a
#define SEG9                             BANKMASK(PORTB), 2, a
#define SEG9COM0                         BANKMASK(LCDDATA1), 1, a
#define SEG9COM1                         BANKMASK(LCDDATA7), 1, a
#define SEG9COM2                         BANKMASK(LCDDATA13), 1, a
#define SEG9COM3                         BANKMASK(LCDDATA19), 1, a
#define SEGEN0                           BANKMASK(LCDSE0), 0, a
#define SEGEN1                           BANKMASK(LCDSE0), 1, a
#define SEGEN10                          BANKMASK(LCDSE1), 2, a
#define SEGEN11                          BANKMASK(LCDSE1), 3, a
#define SEGEN12                          BANKMASK(LCDSE1), 4, a
#define SEGEN13                          BANKMASK(LCDSE1), 5, a
#define SEGEN14                          BANKMASK(LCDSE1), 6, a
#define SEGEN15                          BANKMASK(LCDSE1), 7, a
#define SEGEN16                          BANKMASK(LCDSE2), 0, a
#define SEGEN17                          BANKMASK(LCDSE2), 1, a
#define SEGEN18                          BANKMASK(LCDSE2), 2, a
#define SEGEN19                          BANKMASK(LCDSE2), 3, a
#define SEGEN2                           BANKMASK(LCDSE0), 2, a
#define SEGEN20                          BANKMASK(LCDSE2), 4, a
#define SEGEN21                          BANKMASK(LCDSE2), 5, a
#define SEGEN22                          BANKMASK(LCDSE2), 6, a
#define SEGEN23                          BANKMASK(LCDSE2), 7, a
#define SEGEN24                          BANKMASK(LCDSE3), 0, a
#define SEGEN25                          BANKMASK(LCDSE3), 1, a
#define SEGEN26                          BANKMASK(LCDSE3), 2, a
#define SEGEN27                          BANKMASK(LCDSE3), 3, a
#define SEGEN28                          BANKMASK(LCDSE3), 4, a
#define SEGEN29                          BANKMASK(LCDSE3), 5, a
#define SEGEN3                           BANKMASK(LCDSE0), 3, a
#define SEGEN30                          BANKMASK(LCDSE3), 6, a
#define SEGEN31                          BANKMASK(LCDSE3), 7, a
#define SEGEN32                          BANKMASK(LCDSE4), 0, a
#define SEGEN33                          BANKMASK(LCDSE4), 1, a
#define SEGEN34                          BANKMASK(LCDSE4), 2, a
#define SEGEN35                          BANKMASK(LCDSE4), 3, a
#define SEGEN36                          BANKMASK(LCDSE4), 4, a
#define SEGEN37                          BANKMASK(LCDSE4), 5, a
#define SEGEN38                          BANKMASK(LCDSE4), 6, a
#define SEGEN39                          BANKMASK(LCDSE4), 7, a
#define SEGEN4                           BANKMASK(LCDSE0), 4, a
#define SEGEN40                          BANKMASK(LCDSE5), 0, a
#define SEGEN41                          BANKMASK(LCDSE5), 1, a
#define SEGEN42                          BANKMASK(LCDSE5), 2, a
#define SEGEN43                          BANKMASK(LCDSE5), 3, a
#define SEGEN44                          BANKMASK(LCDSE5), 4, a
#define SEGEN45                          BANKMASK(LCDSE5), 5, a
#define SEGEN46                          BANKMASK(LCDSE5), 6, a
#define SEGEN47                          BANKMASK(LCDSE5), 7, a
#define SEGEN5                           BANKMASK(LCDSE0), 5, a
#define SEGEN6                           BANKMASK(LCDSE0), 6, a
#define SEGEN7                           BANKMASK(LCDSE0), 7, a
#define SEGEN8                           BANKMASK(LCDSE1), 0, a
#define SEGEN9                           BANKMASK(LCDSE1), 1, a
#define SEN                              BANKMASK(SSP1CON2), 0, a
#define SEN1                             BANKMASK(SSP1CON2), 0, a
#define SENDB                            BANKMASK(TXSTA1), 3, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SLPEN                            BANKMASK(LCDCON), 6, a
#define SMP                              BANKMASK(SSP1STAT), 7, a
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN                             BANKMASK(RCSTA1), 7, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SPIOD                            BANKMASK(TRISG), 7, a
#define SREN                             BANKMASK(RCSTA1), 5, a
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SS1                              BANKMASK(PORTF), 7, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSP1IE                           BANKMASK(PIE1), 3, a
#define SSP1IF                           BANKMASK(PIR1), 3, a
#define SSP1IP                           BANKMASK(IPR1), 3, a
#define SSPEN                            BANKMASK(SSP1CON1), 5, a
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSP1CON1), 0, a
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM012                          BANKMASK(LCDDATA12), 0, a
#define SSPM1                            BANKMASK(SSP1CON1), 1, a
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM112                          BANKMASK(LCDDATA12), 1, a
#define SSPM2                            BANKMASK(SSP1CON1), 2, a
#define SSPM21                           BANKMASK(SSP1CON1), 2, a
#define SSPM212                          BANKMASK(LCDDATA12), 2, a
#define SSPM3                            BANKMASK(SSP1CON1), 3, a
#define SSPM31                           BANKMASK(SSP1CON1), 3, a
#define SSPM312                          BANKMASK(LCDDATA12), 3, a
#define SSPOV                            BANKMASK(SSP1CON1), 6, a
#define SSPOV1                           BANKMASK(SSP1CON1), 6, a
#define START                            BANKMASK(SSP1STAT), 3, a
#define START1                           BANKMASK(SSP1STAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSP1STAT), 4, a
#define STOP1                            BANKMASK(SSP1STAT), 4, a
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC                             BANKMASK(TXSTA1), 4, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define SYNC2                            BANKMASK(TXSTA2), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T13CKI                           BANKMASK(PORTC), 0, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1INSYNC                         BANKMASK(T1CON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1OSI                            BANKMASK(PORTC), 1, a
#define T1OSO                            BANKMASK(PORTC), 0, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T1RUN                            BANKMASK(T1CON), 6, a
#define T1SYNC                           BANKMASK(T1CON), 2, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CCP1                           BANKMASK(T3CON), 3, a
#define T3CCP2                           BANKMASK(T3CON), 6, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS019                        BANKMASK(LCDDATA19), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3CKPS119                        BANKMASK(LCDDATA19), 5, a
#define T3INSYNC                         BANKMASK(T3CON), 2, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T3SYNC                           BANKMASK(T3CON), 2, a
#define T4CKPS016                        BANKMASK(LCDDATA16), 0, a
#define T4CKPS116                        BANKMASK(LCDDATA16), 1, a
#define T4OUTPS016                       BANKMASK(LCDDATA16), 3, a
#define T4OUTPS116                       BANKMASK(LCDDATA16), 4, a
#define T4OUTPS216                       BANKMASK(LCDDATA16), 5, a
#define T4OUTPS316                       BANKMASK(LCDDATA16), 6, a
#define TGEN                             BANKMASK(CTMUCONH), 4, b
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS                           BANKMASK(T1CON), 1, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS                           BANKMASK(T3CON), 1, a
#define TMR3CS019                        BANKMASK(LCDDATA19), 6, a
#define TMR3CS119                        BANKMASK(LCDDATA19), 7, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TO                               BANKMASK(RCON), 3, a
#define TOCKI                            BANKMASK(PORTA), 4, a
#define TRIGSEL                          BANKMASK(ADCON1), 7, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
